node.js/app/controllers/comments_controller.rb

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
INSERT INTO "comments" ("created_at", "title", "updated_at", "post_id", "content") VALUES('2010-09-08 19:12:46', '56456456', '2010-09-08 19:12:46', 1, 'b.jdsljflksflksfs
---
  def create
    post = Post.find(params[:post_id])
    comment = Comment.new params[:comment]
    post.comments << comment