node.js/app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT * FROM "posts"

  def show
    @post = Post.find params[:id]
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)

  def create
    @post = Post.new params[:post]
    if @post.save
---
INSERT INTO "posts" ("created_at", "title", "updated_at", "content") VALUES('2010-09-08 17:11:42', 'Title', '2010-09-08 17:11:42', 'Content')